---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.CutProfile
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.CutProfile

Changes the shape of elements that are cut in a view, such as roofs, walls, floors, and the layers of compound structures.